"""
Хайку - жанр традиційної японської ліричної поезії століття, відомий з XIV століття.
Оригінальне японське хайку складається з 17 складів, що становлять один стовпець ієрогліфів.
Особливими розділовими словами - Крезі - текст хайку розділяється на частини з 5, 7 і знову 5 складів.
При перекладі хайку на західні мови традиційно замість розділового слова використовують розрив рядка і,
таким чином, хайку записуються як тривіршів.
Перед вами тривірші, які претендують на те, щоб бути хайку.
Як роздільник рядків використовуються символи "/". Якщо роздільники ділять текст на рядки,
в яких 5/7/5 складів, то виведіть «Хайку!». Якщо число рядків не дорівнює 3,
то виведіть рядок «Не хайку. Повинно бути 3 рядки.» Інакше виведіть рядок виду «Не хайку.
В i рядку складів не s, а j.», Де рядок i - перший рядок, в якому кількість складів неправильна.
Для простоти будемо вважати, що кількість складів дорівнює кількості голосних.
                       Ще не померла! /
                       Закінчується осінь, /
                       Я йду за обрій.                      - Хайку!

                       Ночую просто неба. /
                       Виє пес. /
                       Теж допекла, мабуть, осіння мряка!   - Не хайку! У першому рядку 7 складів замість 5.

                       Вода замерзла, /
                       Розколовши глечик. /
                       І тріск раптовий розбудив мене.      - Не хайку! У другому рядку 6 складів замість 7.
"""

haiku1 = "Ще не померла! / Закінчується осінь, / Я йду за обрій."  # Haiku
haiku2 = "Ночую просто неба. / Виє пес. / Теж допекла, мабуть, осіння мряка!"  # Not a haiku
haiku3 = "Вода замерзла, / Розколовши глечик. / І тріск раптовий розбудив мене"  # Not a haiku

golosni = ["а", "о", "у", "и", "і", "е", "я", "ю", "є", "ї"]


def isGol(s):
    return s.lower() in golosni


# print(isGol(golosni[2]))


def isHajku(text):
    line = 0
    slog = [0, 0, 0]
    s = text
    for i in range(len(s)):
        if s[i] == '/':  # Як роздільник рядків використовуються символи "/"
            line = line + 1  #
        if isGol(s[i]):
            slog[line] = slog[line] + 1
    # print(slog)
    if slog[0] == 5 and slog[1] == 7 and slog[2] == 5:
        return "Хайку!"
    else:
        return "Не хайку!"


for h in (haiku1, haiku2, haiku3):
    print(h, " -- ", isHajku(h))
