
"""
Напишіть скрипт, який буде отримувати текст
і переформатує його таким чином, щоб кожне речення займало лише один рядок.
Для простоти вважатимемо, що
- кожне речення починається з великої кириличної або латинської літери;
- кожне речення закінчується одним з роздільних знаків ".;!?"
- між реченнями можуть знаходитись будь-яка кількість пробільних символів;
- в середині тексту відсутні великих букв та крапок;
- порожніх рядків у виводі не повинно бути;
- будь-які набори з більш ніж одного пробільного символу замінюйте на один пробіл.
Контрольний текст:
"В        цьому
реченні розриви рядків... Але це
не так важливо! Зовсім? Так, зовсім! І це не повинно   заважати."
Вивід:
"В цьому реченні розриви рядків...
Але це не так важливо!
Зовсім?
Так, зовсім!
І це не повинно заважати."
"""

text = """
Контрольний текст:;
"В        цьому
реченні розриви рядків... Але це
не так важливо! Зовсім? Так, зовсім! І це не повинно   заважати."

"""

print('---------------->>>')
print(text)
print('----------------<<<')
print('\n')

newText = ""
MaxInd = len(text)-1
i = 0
while True:
    if i > MaxInd:
        break
    if text[i:i+3] == '...':                                                # 1. Very special case 'xxx...yyy'
        newText = newText + '..'
        i = i+2
        continue
    elif text[i].isspace() and i < MaxInd and text[i+1].isspace():          # 2. "xxx     yyy"  -->> "xxx yyy"   - skip multiple spaces
        pass
    elif text[i] == '\r' or text[i] == '\n':                                # 3. EOL (EndOfLine)  Windows: '\r\n', Linux: '\n',  MacOs: '\r'
        newText = newText + ' '
    elif text[i] == '.' or text[i] == '!' or text[i] == '?' or text[i] == ';':  # 4. Seems, it is EOL !
        newText = newText + text[i] + '\n'
        while i < MaxInd and text[i+1].isspace():                           #    and skip spaces at start of line ...
            i = i+1
    else:                                                                  # 5. AS IS - symbol to symbol
        newText = newText + text[i]
    i = i + 1

print('---------------->>>')
print(newText)
print('----------------<<<')
print('\n')
